{"rating": 3.8, "tags": ["voice", "cucm", "conference", "dsp"], "name": "Conference Bridge Registration to CUCM", "products": [{"name": "ISR", "devices": ["ISR4421", "ISR4321", "ISR4331", "ISR4351", "ISR4431", "ISR4351"]}], "var": [{"default": null, "var": "maximum_sessions", "type": "int()", "desc": "Maximum sessions allowed on the conference bridge. This will depend on the amount of DSP resources availible."}, {"default": null, "var": "sccp_source_interface", "type": "string()", "desc": "This is the interface from which SCCP messages are sourced. This is usually a Loopback."}, {"default": null, "var": "cucm_1_ipv4_address", "type": "ipaddr('address')", "desc": "The IPv4 address of the primary CUCM used for conference bridge registration in a cluster. This is where the SCCP based conference bridge will register."}, {"default": null, "var": "cucm_2_ipv4_address", "type": "ipaddr('address')", "desc": "The IPv4 address of the secondary CUCM used for conference bridge registration in a cluster. This is where the SCCP based conference bridge will register."}, {"default": null, "var": "conference_bridge_registration_name", "type": "string()", "desc": "The descriptive name used to register to CUCM. This name will appear, with the assigned domain name, on CUCM once the converence bridge has succesfully registered."}], "cond": [], "usage": "clean", "OS": "IOS-XE", "description": "All routers need a minimum of a packet voice digital signal processor (DSP) module (PVDM3-64) in order to create five 8-party conference bridge resources along with the DSPs needed for voice gateway services. If your organization needs more conference resources, you will need additional DSPs. The router requires additional DSPs and configuration if hardware- based transcoding is needed. By default, calls to Cisco Unity Connection are transcoded in the server. The router at the main site can provide unified communications gateway functions. Therefore, it should be configured with sufficient DSPs and a T1/ E1 voice/WAN interface card (VWIC) for the PSTN primary rate interface (PRI) configurations. The Cisco 3945 and 3925 Integrated Services Routers with voice security (VSEC) ship with a PVDM3-64, so they have enough DSPs to handle one voice T1 and five 8-party conferences. If the remote site uses E1, they will have enough DSPs for only four 8-party conferences. The Cisco 2911 Integrated Services Router (ISR) with VSEC ships with a PVDM3-16, and the 2921 ISR with VSEC and 2951 ISR with VSEC ship with a PVDM3-32. The Cisco 2900 Series ISRs have to be upgraded to a single PVDM3-64 DSP in order to allow sufficient resources for a single voice T1 and at least five 8-party conferences. Apply the following configuration in the HQ router in order to register the five conference-bridge resources as the highest priority on the subscriber and as the second priority on the publisher. The same configuration is used in the remote-site routers if conferencing resources are needed.\n"}
